interface IconProps {
    size: "sm" | "md" | "lg";
  }
  const iconVarients = {
    sm: "22", // ⬅️ Fixed: "sm" should be smallest
    md: "26", // ⬅️ Fixed: "md" should be medium-sized
    lg: "70", // ⬅️ Fixed: "lg" should be largest
  };
  
  export const BrainIcon = (props: IconProps) => {
    return (
        <svg version="1.0" xmlns="http://www.w3.org/2000/svg"

         width={iconVarients[props.size]} height={iconVarients[props.size]} viewBox="0 0 56.000000 63.000000"
         preserveAspectRatio="xMidYMid meet">
        <metadata>
        </metadata>
        <g transform="translate(0.000000,65.000000) scale(0.100000,-0.100000)"
        fill="#5046e4" stroke="none">
        <path d="M215 520 c-32 -12 -88 -90 -96 -134 -4 -23 -11 -54 -15 -69 -7 -31
        22 -104 59 -145 24 -26 72 -29 105 -6 20 14 24 14 38 0 24 -25 81 -20 109 9
        14 13 25 33 25 44 0 11 8 24 17 29 29 17 11 172 -23 201 -11 9 -27 28 -37 44
        -13 20 -25 27 -50 27 -17 0 -39 -4 -47 -10 -8 -5 -19 -5 -25 -1 -19 15 -40 18
        -60 11z m53 -93 c3 -51 0 -60 -24 -82 -21 -19 -25 -28 -16 -37 8 -8 15 -8 27
        2 13 11 15 6 15 -42 0 -68 -24 -97 -67 -82 -30 10 -43 34 -19 34 25 0 19 28
        -6 32 -12 2 -29 15 -37 30 -14 25 -14 29 7 51 20 21 22 28 11 45 -10 17 -10
        23 1 37 10 11 15 13 20 4 12 -18 32 0 25 22 -9 26 13 51 39 47 18 -3 21 -11
        24 -61z m100 33 c5 -45 11 -54 26 -40 12 9 17 7 27 -11 9 -17 9 -24 0 -27 -16
        -5 -14 -27 4 -42 8 -7 15 -26 15 -42 0 -24 -6 -32 -35 -44 -35 -14 -39 -34 -8
        -34 14 0 14 -3 -2 -20 -20 -22 -55 -26 -73 -8 -7 7 -12 38 -12 71 0 52 2 58
        15 47 13 -10 18 -11 28 -1 9 10 6 17 -15 33 -25 17 -28 26 -28 77 0 64 5 73
        35 69 13 -2 21 -12 23 -28z"/>
        </g>
        </svg>
    );
  };
  